/*************************************************************************
	> File Name: EP01.cpp
	> Author: ma6174
	> Mail: ma6174@163.com 
	> Created Time: 2019年12月15日 星期日 14时52分54秒
 ************************************************************************/
#include <stdio.h>

int is_val() {
	

	return 0;
}
int main() {
int n;
int sum;
	for(int i = 2; i < 1000; i++){
          if(i % 3 !=0 && i % 5 != 0) continue;
	      sum += i;
	}
 printf("%d",sum);
	//int sum3 = (3 + 999) * 333 / 2;
//	int sum5 = (5 + 995) * (995/5) /2;
//	int sum15= (15 + (999 / 15) * 15) * (999/ / 15) / 2;
}
